# Задания

### Вопрос

Скомпилируйте [следующий файл](./questions/alignas.c) и посмотрите содержимое секции `.data` с помощью `objdump`. По какому адресу начинается переменная `x`? Попробуйте убрать `_Alignas(128)` и объясните эффект.


### Вопрос

Напишите минимальный пример с таким кодом, скомпилируйте его со строгим соответствием стандарту `C17` (`-std=c17 -pedantic -Wall`).  Что выведет компилятор? Объясните сообщение.


### Вопрос

Найдите в AST для примера ниже имя класса. Какие поля хранятся в узле этого дерева? Как вы думаете, зачем?

https://astexplorer.net/

```java
public class Program {
    public static void main(String[] args) {
        int x = 100;
        if (x > 0) {
            System.out.println("Greater than zero"); 
        }
        else {
            System.out.println("Less than or equal to zero"); 
        }
    }
}
```


## Задание 0.5

Найдите в AST для примера выше конструкцию `if`. Добавьте код так, чтобы повторить ситуацию с вложенным в `if` предложением `if-else` из первого примера. Нарисуйте примерный вид AST для него.


### Вопрос

Что выведется в `stdout`? Если это неожиданный результат, как переписать `dbl` чтобы избавиться от нежелательного и неожиданного поведения?

```c
#define dbl(y) y * 2

...
printf("%d", dbl(3+3));
```

## Задание 1

Напишите программу которая будет использовать этот макрос для вывода переменной, числа и константы, заданной с использованием макроса. Протестируйте её с помощью ключа `-E` для `gcc/clang`.

```c
#define print_var(x) printf(#x " is %d", x )
```

[task1](./task1/)


### Вопрос

Что будет если написать `print_var(42)`?


### Вопрос

Протестируйте [эту программу](./questions/int_print.c) с помощью ключа `-E` для `gcc/clang`.


### Вопрос

Протестируйте [эту программу](./questions/generic_print.c) с помощью ключа `-E` для `gcc/clang`. Что раскрывается раньше: `_Generic` или `#define`?

## Задание 2

Напишите функции добавления элемента **в конец обобщённого списка** и вывода обобщённого списка на экран используя макросы: функции `list_##type##_push` и `list_##type##_print` внутри макроса `DEFINE_LIST`.  Создайте и выведите с их помощью три любых списка разной длины.

[task2](./task2/)


## Задание 3

Напишите функции добавления элемента **в конец обобщённого списка** и вывода обобщённого списка на экран используя generic: макросы `list_push` и `list_print`, которые используют `_Generic`. Создайте и выведите с их помощью три любых списка разной длины.

[task3](./task3/)


## Задание 4

Изучим [простой принтер для AST-дерева](https://gitlab.se.ifmo.ru/programming-languages/cse-programming-languages-fall-2023/main/-/blob/master/seminar-5/printer.c). Дерево будем задавать прямо в коде с помощью небольшого доменно-специфичного языка, который определим прямо в программе.

Допишите в main код, чтобы вывести следующие выражения (можно со скобками):

    999 + 728
    4+2*9

Расширьте этот пример, добавив тип вершин AST для деления и принтер для него.
Выведите следующее выражение:

    (3+5) * (9 / 7)

[task4](./task4/)
